import FaqItem from "./FaqItem";
import { motion } from "motion/react";
import { headerVariants } from "@/utils/animationVariants";

export default function FaqList() {
  const faqList = [
    {
      question: "Чи є у вас укриття?",
      answer: "Так, на -1 поверсі є облаштоване укриття.",
    },
    {
      question: "Чи потрібно залишати простір під час повітряної тривоги?",
      answer:
        "Батьки/вихователі/няні несуть відповідальність за життя та здоровʼя власних дітей. Рішення щодо перебування на локації приймають виключно відповідальні дорослі.",
    },
    {
      question: "Чи є у вас власний паркінг?",
      answer:
        "Великий безкоштовний паркінг знаходиться в 3 хвилинах від нас - парковка Епіцентру. Також на території ЖК є платний паркінг, забронювати місце Ви можете через нашого адміністратора.",
    },
    {
      question: "Чи можна залишити дитину і піти?",
      answer:
        "Дитина має бути постійно в супроводі дорослого. Це можуть бути батьки або няня дитини. У нашому просторі є можливість скористатися послугою погодинної няні, оплачується окремо.",
    },
    {
      question: "На який вік розрахований простір?",
      answer: "У нас буде цікаво дітям до 8 років.",
    },
    {
      question: "Чи можна приносити власні іграшки?",
      answer:
        "В пісочницю не можна брати власні іграшки, бо ми дуже відповідально ставимося до чистоти і безпеки. Наші іграшки проходять щоденну стерилізацію та кварцування.",
    },
    {
      question: "Чи працюєте ви без світла?",
      answer: "Так, в просторі передбачені резервні системи живлення.",
    },
    {
      question: "Як очищається пісок?",
      answer:
        "Двічі на добу пісок кварцується. Раз на півроку пісок повністю замінюється.",
    },
  ];

  return (
    <motion.ul
      initial="hidden"
      whileInView="visible"
      exit="exit"
      viewport={{ once: true, amount: 0.1 }}
      variants={headerVariants}
      className="flex flex-col gap-3.5 lg:gap-6"
    >
      {faqList.map((faqItem, idx) => (
        <FaqItem key={idx} faqItem={faqItem} idx={idx} />
      ))}
    </motion.ul>
  );
}
